<?xml version="1.0" encoding="UTF-8"?>
<!-- $Revision$ -->
<!-- EN-Revision: 1.1 Maintainer: andreas Status: ready -->
		<sect1 id="language.modifier.date.format">
			<title>date_format (Datums Formatierung)</title>
            <informaltable frame="all">
                <tgroup cols="5">
                <colspec colname="param" align="center" />
                <colspec colname="type" align="center" />
                <colspec colname="required" align="center" />
                <colspec colname="default" align="center" />
                <colspec colname="desc" />
                <thead>
                    <row>
                        <entry>Parameter Position</entry>
                        <entry>Typ</entry>
                        <entry>Erforderlich</entry>       
                        <entry>Standardwert</entry>
                        <entry>Beschreibung</entry>
                    </row>
                </thead>
                <tbody>
                    <row>
                        <entry>1</entry>
                        <entry>string</entry>
                        <entry>Nein</entry>
                        <entry>%b %e, %Y</entry>
                        <entry>Das Format des ausgegebenen Datums.</entry>
                    </row>
                    <row>
                        <entry>2</entry>
                        <entry>string</entry>
                        <entry>Nein</entry>
                        <entry>n/a</entry>
                        <entry>Der Standardwert (Datum) wenn die Eingabe leer ist.</entry>
                    </row>
                </tbody>
                </tgroup>
            </informaltable>
			<para>
	    		Formatiert Datum und Uhrzeit in das definierte 'strftime()'-Format.
			Daten k&ouml;nnen als Unix-Timestamps, MySQL-Timestamps
			und jeder Zeichenkette die aus 'Monat Tag Jahr' (von strtotime parsebar) besteht
			&uuml;bergeben werden. Designer k&ouml;nnen 'date_format' verwenden,
			um vollst&auml;ndige Kontrolle &uuml;ber das Format des Datums zu erhalten.
			Falls das &uuml;bergebene Datum leer ist und der zweite Parameter
			&uuml;bergeben wurde, wird dieser formatiert und ausgegeben.
			</para>
<example>
<title>date_format (Datums Formatierung)</title>
<programlisting>
{$smarty.now|date_format}
{$smarty.now|date_format:"%A, %B %e, %Y"}
{$smarty.now|date_format:"%H:%M:%S"}

AUSGABE:

Feb 6, 2001
Tuesday, February 6, 2001
14:33:00</programlisting>
</example>
<example>
<title>'date_format' Konvertierungs Spezifikation</title>
<programlisting>
%a - abgek&uuml;rzter Name des Wochentages, abh&auml;ngig von der gesetzten Umgebung

%A - ausgeschriebener Name des Wochentages, abh&auml;ngig von der gesetzten Umgebung

%b - abgek&uuml;rzter Name des Monats, abh&auml;ngig von der gesetzten Umgebung

%B - ausgeschriebener Name des Monats, abh&auml;ngig von der gesetzten Umgebung

%c - Wiedergabewerte f&uuml;r Datum und Zeit, abh&auml;ngig von der gesetzten Umgebung

%C - Jahrhundert (Jahr geteilt durch 100, gek&uuml;rzt auf Integer, Wertebereich 00 bis 99)

%d - Tag des Monats als Zahl (Bereich 00 bis 31)

%D - so wie %m/%d/%y

%e - Tag des Monats als Dezimal-Wert, einstelligen Werten wird ein Leerzeichen voran gestellt (Wertebereich Ž 0Ž bis Ž31Ž)

%g - wie %G, aber ohne Jahrhundert.

%G - Das vierstellige Jahr entsprechend der ISO Wochennummer (siehe %V). Das gleiche Format und der gleiche Wert wie bei %Y. Besonderheit: entspricht die ISO Wochennummer dem vorhergehenden oder folgenden Jahr, wird dieses Jahr verwendet.

%h - so wie %b

%H - Stunde als Zahl im 24-Stunden-Format (Bereich 00 bis 23)

%I - Stunde als Zahl im 12-Stunden-Format (Bereich 01 bis 12)

%j - Tag des Jahres als Zahl (Bereich 001 bis 366)

%m - Monat als Zahl (Bereich 01 bis 12)

%M - Minute als Dezimal-Wert

%n - neue Zeile

%p - entweder `am' oder `pm' (abh&auml;ngig von der gesetzten Umgebung) oder die entsprechenden Zeichenketten der gesetzten Umgebung

%r - Zeit im Format a.m. oder p.m.

%R - Zeit in der 24-Stunden-Formatierung

%S - Sekunden als Dezimal-Wert

%t - Tabulator

%T - aktuelle Zeit, genau wie %H:%M:%S

%u - Tag der Woche als Dezimal-Wert [1,7], dabei ist 1 der Montag.

%U - Nummer der Woche des aktuellen Jahres als Dezimal-Wert, beginnend mit dem ersten Sonntag als erstem Tag der ersten Woche.

%V - Kalenderwoche (nach ISO 8601:1988) des aktuellen Jahres. Als Dezimal-Zahl mit dem Wertebereich 01 bis 53, wobei die Woche 01 die erste Woche mit mindestens 4 Tagen im aktuellen Jahr ist. Die Woche beginnt montags (nicht sonntags). (Benutzen Sie %G or %g f&uuml;r die Jahreskomponente, die der Wochennummer f&uuml;r den gegebenen Timestamp entspricht.)

%w - Wochentag als Dezimal-Wert, Sonntag ist 0

%W - Nummer der Woche des aktuellen Jahres, beginnend mit dem ersten Montag als erstem Tag der ersten Woche.

%x - bevorzugte Datumswiedergabe (ohne Zeit), abh&auml;ngig von der gesetzten Umgebung.

%X - bevorzugte Zeitwiedergabe (ohne Datum), abh&auml;ngig von der gesetzten Umgebung.

%y - Jahr als 2-stellige-Zahl (Bereich 00 bis 99)

%Y - Jahr als 4-stellige-Zahl inklusive des Jahrhunderts

%Z - Zeitzone, Name oder eine Abk&uuml;rzung

%% - ein %-Zeichen

BEMERKUNG F&Uuml;R PROGRAMMIERER: 'date_format' ist ein wrapper f&uuml;r PHP's 'strftime()'-Funktion.
Je nachdem auf welchem System ihr PHP kompiliert wurde, ist es durchaus m&ouml;glich, dass nicht alle
angegebenen Formatierungszeichen unterst&uuml;tzt werden. Beispielsweise stehen %e, %T, %R und %D 
(eventuell weitere) auf Windowssystemen nicht zur Verf&uuml;gung.</programlisting>
</example>
</sect1>
<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
